#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cloudfront.module.rewrite_index_edge_lambda[0].data.archive_file.rewrite_index: Reading...
module.cloudfront.module.rewrite_index_edge_lambda[0].data.archive_file.rewrite_index: Read complete after 0s [id=651b7b074ee53a255c2fc2bdaa28a8ce97f29b18]
module.cloudfront.module.rewrite_index_edge_lambda[0].data.aws_iam_policy_document.rewrite_index: Reading...
module.cloudfront.module.rewrite_index_edge_lambda[0].aws_cloudwatch_log_group.rewrite_index: Refreshing state... [id=/aws/lambda/rewrite_index]
module.cloudfront.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-1:772883009446:certificate/74f50db1-4868-46be-b16b-af214e6f0117]
module.cloudfront.module.rewrite_index_edge_lambda[0].data.aws_iam_policy_document.rewrite_index: Read complete after 0s [id=1349007126]
module.cloudfront.module.cache_policy_default.aws_cloudfront_cache_policy.this: Refreshing state... [id=361535e8-7aa8-4df7-9a8b-b45d63721240]
module.cloudfront.module.response_headers_policy.aws_cloudfront_response_headers_policy.this: Refreshing state... [id=074fb546-175e-4f40-9e21-808cc9ad5545]
module.cloudfront.module.rewrite_index_edge_lambda[0].aws_iam_role.rewrite_index: Refreshing state... [id=terraform-20240530195824914200000001]
data.aws_route53_zone.italiaopensource: Reading...
aws_cloudfront_origin_access_control.this: Refreshing state... [id=E2AB4PVD457056]
aws_s3_bucket.website: Refreshing state... [id=italiaopensource.com-website-772883009446-production]
module.cloudfront.module.rewrite_index_edge_lambda[0].aws_lambda_function.rewrite_index: Refreshing state... [id=rewrite_index]
data.aws_route53_zone.italiaopensource: Read complete after 0s [id=Z0739820YIMGD5QTLD2]
module.cloudfront.aws_route53_record.acm_certificate_cname["italiaopensource.com"]: Refreshing state... [id=Z0739820YIMGD5QTLD2__f2bc522d40048bb8a70fecadafd7bd79.italiaopensource.com._CNAME]
module.cloudfront.aws_route53_record.acm_certificate_cname["*.italiaopensource.com"]: Refreshing state... [id=Z0739820YIMGD5QTLD2__f2bc522d40048bb8a70fecadafd7bd79.italiaopensource.com._CNAME]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=italiaopensource.com-website-772883009446-production]
aws_s3_bucket_cors_configuration.website: Refreshing state... [id=italiaopensource.com-website-772883009446-production]
module.cloudfront.aws_cloudfront_distribution.this: Refreshing state... [id=ELT266E4971IF]
data.aws_iam_policy_document.access_origin_control: Reading...
module.cloudfront.aws_route53_record.this["italiaopensource.com"]: Refreshing state... [id=Z0739820YIMGD5QTLD2_italiaopensource.com_A]
module.cloudfront.aws_route53_record.this["www.italiaopensource.com"]: Refreshing state... [id=Z0739820YIMGD5QTLD2_www.italiaopensource.com_A]
data.aws_iam_policy_document.access_origin_control: Read complete after 0s [id=1442699240]
aws_s3_bucket_policy.website: Refreshing state... [id=italiaopensource.com-website-772883009446-production]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_origin_access_control.this will be updated in-place
  ~ resource "aws_cloudfront_origin_access_control" "this" {
        id                                = "E2AB4PVD457056"
      ~ name                              = "italiaopensource-website" -> "italiaopensource-website-production"
        # (5 unchanged attributes hidden)
    }

  # module.cloudfront.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "ELT266E4971IF"
        tags                            = {
            "Environment" = "production"
            "Project"     = "italiaopensource"
            "service"     = "website"
        }
        # (22 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "viewer-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:772883009446:function:rewrite_index:2" -> null
            }
          + lambda_function_association {
              + event_type   = "viewer-request"
              + include_body = false
              + lambda_arn   = (known after apply)
            }
        }

        # (10 unchanged blocks hidden)
    }

  # module.cloudfront.module.cache_policy_default.aws_cloudfront_cache_policy.this will be updated in-place
  ~ resource "aws_cloudfront_cache_policy" "this" {
        id          = "361535e8-7aa8-4df7-9a8b-b45d63721240"
      ~ name        = "deault" -> "deault-production"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cloudfront.module.response_headers_policy.aws_cloudfront_response_headers_policy.this will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "this" {
        id      = "074fb546-175e-4f40-9e21-808cc9ad5545"
      ~ name    = "default" -> "deault-production"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cloudfront.module.rewrite_index_edge_lambda[0].aws_cloudwatch_log_group.rewrite_index must be replaced
-/+ resource "aws_cloudwatch_log_group" "rewrite_index" {
      ~ arn               = "arn:aws:logs:us-east-1:772883009446:log-group:/aws/lambda/rewrite_index" -> (known after apply)
      ~ id                = "/aws/lambda/rewrite_index" -> (known after apply)
      ~ log_group_class   = "STANDARD" -> (known after apply)
      ~ name              = "/aws/lambda/rewrite_index" -> "/aws/lambda/rewrite-index-production" # forces replacement
      + name_prefix       = (known after apply)
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.cloudfront.module.rewrite_index_edge_lambda[0].aws_lambda_function.rewrite_index must be replaced
-/+ resource "aws_lambda_function" "rewrite_index" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:us-east-1:772883009446:function:rewrite_index" -> (known after apply)
      ~ code_sha256                    = "uH9RwtpyRqIiCASnF23vxceWcpmEh+GOJ3F7iCdzaho=" -> (known after apply)
      ~ function_name                  = "rewrite_index" -> "rewrite-index-production" # forces replacement
      ~ id                             = "rewrite_index" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:772883009446:function:rewrite_index/invocations" -> (known after apply)
      ~ last_modified                  = "2024-05-30T21:19:01.000+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:772883009446:function:rewrite_index:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:772883009446:function:rewrite_index:2/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 459 -> (known after apply)
      - tags                           = {} -> null
      ~ tags_all                       = {} -> (known after apply)
      ~ version                        = "2" -> (known after apply)
        # (15 unchanged attributes hidden)

      ~ ephemeral_storage (known after apply)
      - ephemeral_storage {
          - size = 512 -> null
        }

      ~ logging_config (known after apply)
      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/rewrite_index" -> null
            # (2 unchanged attributes hidden)
        }

      ~ tracing_config (known after apply)
      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

Plan: 2 to add, 4 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>


*Pusher: @FabrizioCafolla, Action: `pull_request`, Workflow: [link](https://github.com/italia-opensource/italiaopensource.com/actions/runs/12019782256)*